Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When an exception occurs, RESTEasy Reactive does not log it by default (for security reasons). This can sometimes make it hard to understand why certain exception handling code was invoked (or not invoked). To make RESTEasy Reactive log the actual exception before an exception mapping code is run the `org.jboss.resteasy.reactive.common.core.AbstractResteasyReactiveContext` log category can be set to `DEBUG` like so:
ja_jp: 例外が発生した場合、RESTEasy Reactive はデフォルトでログを記録しません (セキュリティ上の理由による)。 このため、特定の例外処理コードが呼び出された (または呼び出されなかった) 理由を理解するのが難しい場合があります。 RESTEasy Reactive が例外マッピングコードを実行する前に実際の例外をログするようにするには、次のように `org.jboss.resteasy.reactive.common.core.AbstractResteasyReactiveContext` ログカテゴリを `DEBUG` に設定します。

source: When an inclusive authentication is enabled, the <<mutual-tls>> mechanism has the highest priority by default, to reflect on the fact that when it is used, it is enforced early at the transport level, and to ensure that an injected `SecurityIdentity` represents a <<mutual-tls>> authentication. If you need an injected `SecurityIdentity` to represent another authentication mechanism, <<authentication-mechanisms-priority, configure the mechanism priority>>.
ja_jp: 統合認証が有効な場合、<<mutual-tls>> メカニズムはデフォルトで最高の優先度を持ちます。これは、使用時にトランスポートレベルで早期に適用されるという事実を反映し、挿入された `SecurityIdentity` が <<mutual-tls>> 認証を表すことを保証するためです。挿入された `SecurityIdentity` が別の認証メカニズムを表す必要がある場合は、<<authentication-mechanisms-priority, メカニズムの優先度を設定>> してください。

source: When an incoming request matches a valid certificate in the truststore, your application can obtain the subject by injecting a `SecurityIdentity` as follows:
ja_jp: 受信リクエストがトラストストア内の有効な証明書と一致する場合、アプリケーションは次のように `SecurityIdentity` を注入することでサブジェクトを取得できます。

source: When an offering is configured for a registry in `.quarkus/config.yaml`, `ext list --support-scope` can be used to display support scope associated with extensions from the selected offering. For example,
ja_jp: `.quarkus/config.yaml` でレジストリーのオファリングが設定されている場合、`ext list --support-scope` を使用して、選択されたオファリングのエクステンションに関連付けられたサポートスコープを表示できます。例:

source: When an unauthenticated user accesses a secured path, the user is redirected to the OIDC provider to authenticate and the tenant configuration is used to build the redirect URI.
ja_jp: 認証されていないユーザーがセキュアなパスにアクセスすると、ユーザーは認証のために OIDC プロバイダーにリダイレクトされ、テナント設定を使用してリダイレクト URI が構築されます。

source: When annotating a bean method with `@PreAuthorize("isAnonymous()")` the method will only be accessible if the current user is anonymous - i.e. a non logged in user.
ja_jp: Bean メソッドに `@PreAuthorize("isAnonymous()")` のアノテーションを付ける場合、メソッドにアクセスできるのは、現在のユーザーが匿名の場合、つまりログインしていないユーザーの場合のみです。

source: When annotating a bean method with `@PreAuthorize("isAnonymous()")` the method will only be accessible if the current user is anonymous - i.e. a non logged-in user.
ja_jp: Bean メソッドに `@PreAuthorize("isAnonymous()")` のアノテーションを付ける場合、メソッドにアクセスできるのは、現在のユーザーが匿名の場合、つまりログインしていないユーザーの場合のみです。

source: When annotating a bean method with `@PreAuthorize("isAuthenticated()")` the method will only be accessible if the current user is a logged in user. Essentially the method is only unavailable for anonymous users.
ja_jp: Bean メソッドに `@PreAuthorize("isAuthenticated()")` でアノテーションを付ける場合、現在のユーザーがログインしているユーザーである場合にのみ、メソッドにアクセスできます。基本的に、このメソッドは匿名ユーザーのみが利用できません。

source: When annotating a bean method with `@PreAuthorize("isAuthenticated()")` the method will only be accessible if the current user is a logged-in user. Essentially the method is only unavailable for anonymous users.
ja_jp: Bean メソッドに `@PreAuthorize("isAuthenticated()")` でアノテーションを付ける場合、現在のユーザーがログインしているユーザーである場合にのみ、メソッドにアクセスできます。基本的に、このメソッドは匿名ユーザーのみが利用できません。

source: When applying multiple properties, you can apply them as:
ja_jp: 複数のプロパティーを適用する場合、次のように適用できます。

source: When asked, log in to a `Single Page Application` provided by the OpenID Connect Dev UI:
ja_jp: 求められたら、OpenID Connect Dev UI によって提供される `Single Page Application` にログインします。

source: When binding an interceptor to a component, you can declare multiple `@Repeatable` annotations on methods. Repeatable interceptor bindings declared on classes and stereotypes are not supported, because there are some open questions around interactions with the Interceptors specification. This might be added in the future.
ja_jp: インターセプタ―をコンポーネントにバインドする場合は、メソッドに対して複数の `@Repeatable` アノテーションを宣言できます。インターセプター仕様との相互作用に関する未解決の質問があるため、クラスとステレオタイプで宣言された反復可能なインターセプターバインディングはサポートされていません。これは将来追加される可能性があります。

source: When both a JDBC extension and a reactive datasource extension for the same database kind are included, both JDBC and reactive datasources will be created by default.
ja_jp: 同じデータベースの種類用の JDBC エクステンションとリアクティブデータソースエクステンションが両方とも含まれている場合、デフォルトで JDBC データソースとリアクティブデータソースの両方が作成されます。

source: When building APIs, developers want to test them quickly. https://swagger.io/tools/swagger-ui/[Swagger UI] is a great tool permitting to visualize and interact with your APIs. The UI is automatically generated from your OpenAPI specification.
ja_jp: APIを構築する際、開発者は素早くテストしたいと考えています。 link:https://swagger.io/tools/swagger-ui/[Swagger UI] は、APIを視覚化して対話するための素晴らしいツールです。UIはOpenAPI仕様から自動的に生成されます。

source: When building a multi-module project containing a Quarkus application as one module and various supporting project dependencies as other modules, Quarkus supports placing these supporting modules in a separate container image layer from the rest of the application dependencies, with the expectation that these supporting modules will change more frequently than the regular application dependencies - thus making a rebuild faster if the application dependencies have not changed.
ja_jp: Quarkusアプリケーションを1つのモジュールとし、さらにさまざまなサポートプロジェクトの依存関係を他のモジュールとして含むマルチモジュールプロジェクトを構築する場合、Quarkusでは、サポートモジュールが通常のアプリケーション依存関係よりも頻繁に変更されることを想定して、それらのサポートモジュールを他のアプリケーション依存関係とは別のコンテナイメージレイヤーに配置することをサポートしています。このため、アプリケーションの依存関係に変更がない場合は、リビルドを高速に行うことができます。

source: When building a native executable Quarkus requires all classes being referenced by the code, no matter if they are build-time or run-time initialized, to be present in the classpath. This way it ensures that there will be no crashes at runtime due to potential `NoClassDefFoundError` exceptions. To achieve this it makes use of GraalVM's `--link-at-build-time` parameter:
ja_jp: Quarkusでは、ネイティブ実行可能ファイルをビルドする際に、コードから参照されるすべてのクラスが、ビルド時か、実行時に初期化されるかに関係なく、クラスパスに存在することが必要です。こうすることで、実行時に潜在的な `NoClassDefFoundError` 例外の発生によるクラッシュすることがないようにします。これを達成するために、それはGraalVMの `--link-at-build-time` パラメータを利用します:

source: When building a native executable, GraalVM operates with a closed world assumption. It analyzes the call tree and removes all the classes/methods/fields that are not used directly.
ja_jp: ネイティブ実行可能ファイルを構築する際、GraalVM はクローズな環境を想定して動作します。これは、コールツリーを解析し、直接使用しないクラス/メソッド/フィールドをすべて削除します。

source: When building a native executable, the permission class must be registered for reflection unless it is also used in at least one `io.quarkus.security.PermissionsAllowed#name` parameter. More details about the `@RegisterForReflection` annotation can be found on the xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] page.
ja_jp: ネイティブ実行可能ファイルを構築する場合、少なくとも 1 つの `io.quarkus.security.PermissionsAllowed#name` パラメーターでも使用されていない限り、権限クラスをリフレクション用に登録する必要があります。 `@RegisterForReflection` アノテーションの詳細は、xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] ページを参照してください。

source: When building an Uber-Jar you can specify entries that you want to exclude from the generated jar by using the `--ignored-entry` argument:
ja_jp: UberJar を作成する際に、 `--ignored-entry` 引数を使用して生成された jar から除外したいエントリーを指定することができます。

source: When building an Uber-Jar you can specify entries that you want to exclude from the generated jar by using the `quarkus.package.ignored-entries` configuration option, this takes a comma separated list of entries to ignore.
ja_jp: Uber-jar をビルドする際に、 `quarkus.package.ignored-entries` 設定オプションを使用して生成された jar から除外したいエントリーを指定することができます。

source: When building container images using the `quarkus-container-image-jib` extension, Quarkus automatically takes care of all the steps needed to generate the archive and make it usable at runtime in the container.
ja_jp: `quarkus-container-image-jib` エクステンションを使用してコンテナイメージをビルドする場合、アーカイブを生成し、コンテナ内で実行時に使用できるようにするために必要なすべての手順は、Quarkus によって自動的に処理されます。

source: When building on recent machines and running your native executable on older machines, you may see the following failure when starting the application:
ja_jp: 最近のマシンでビルドし、古いマシンでネイティブ実行可能ファイルを実行すると、アプリケーションの起動時に次のようなエラーが表示されることがあります：

source: When calling the endpoint `/records` which is defined by the method `getAll` within the above resource using curl, you would get the web links header:
ja_jp: 上記のリソース内でメソッド `getAll` によって定義されたエンドポイント `/records` を curl を使用して呼び出すと、Web リンクヘッダーが取得されます。

source: When code is not modular enough, generated native executables can end up with more code than what the user needs. If a feature is not used and the code gets compiled into the native executable, this is a waste of native compilation time and memory usage, as well as native executable disk space and starting heap size. Even more problems arise when third party libraries or specialized API subsystems are used which cause native compilation or runtime errors, and their use is not modularised enough. A recent problem can be found in the JAXB library, which is capable of deserializing XML files containing images using Java’s AWT APIs. The vast majority of Quarkus XML users don’t need to deserialize images, so there shouldn’t be a need for users applications to include Java AWT code, unless they specifically configure Quarkus to add the JAXB AWT code to the native executable. However, because JAXB code that uses AWT is in the same jar as the rest of the XML parsing code, achieving this separation was rather complex and required the use of Java bytecode substitutions to get around it. These substitutions are hard to maintain and can easily break, hence they should be one's last resort.
ja_jp: コードが十分にモジュール化されていない場合、生成されたネイティブ実行可能ファイルには、ユーザーが必要とする以上のコードが含まれてしまうことがあります。機能が使用されず、コードがネイティブ実行ファイルにコンパイルされる場合、ネイティブコンパイル時間とメモリ使用量、さらにネイティブ実行ファイルのディスクスペースと起動ヒープサイズの無駄となります。さらに、ネイティブコンパイルやランタイムエラーを引き起こすサードパーティライブラリや特殊なAPIサブシステムが使用され、それらの使用が十分にモジュール化されていない場合には、さらに問題が発生します。最近の問題としては、JavaのAWT APIを使用して画像を含むXMLファイルをデシリアライズできるJAXBライブラリが挙げられます。Quarkus XMLユーザーの大半は画像をデシリアライズする必要がないため、ネイティブの実行ファイルにJAXB AWTコードを追加するようQuarkusを特別に設定しない限り、ユーザーアプリケーションにJava AWTコードを含める必要はないはずです。しかし、AWTを使用するJAXBコードは、残りのXMLパースコードと同じjarにあるため、この分離を達成するのはかなり複雑で、Javaバイトコード置換を使用して回避する必要がありました。このような置換はメンテナンスが難しく、簡単に壊れてしまうので、最後の手段であるべきです。

source: When compiling a Quarkus application to a native image, the MySQL support for JMX and Oracle Cloud Infrastructure (OCI) integrations are disabled as they are incompatible with GraalVM native images.
ja_jp: Quarkusアプリケーションをネイティブイメージにコンパイルする場合、MySQLのJMXサポートとOracle Cloud Infrastructure（OCI）統合は、GraalVMネイティブイメージと互換性がないため、無効になります。

source: When compiling a Quarkus application to native-image, the MySQL support for JMX and Oracle Cloud Infrastructure (OCI) integrations are disabled as they are not compatible with GraalVM native-images. The lack of JMX support is a natural consequence of running in native and is unlikely to be resolved. The integration with OCI could be resolved, if you need it we suggest opening a support request with the MySQL Connector/J maintainers.
ja_jp: Quarkusアプリケーションをネイティブイメージにコンパイルする際、MySQLによるJMXのサポートとOracle Cloud Infrastructure（OCI）の統合は、GraalVMのネイティブイメージと互換性がないため無効になります。JMXがサポートされないのは、ネイティブで動作することによる当然の帰結であり、解決する見込みはありません。OCIとの統合は解決される可能性がありますが、もし必要であれば、MySQL Connector/Jのメンテナにサポートリクエストを出すことをお勧めします。

source: When configured, it can use a named `persistence-unit` for the checkpointing state store:
ja_jp: 設定されている場合、チェックポイントのステートストアに名前付き `persistence-unit` を使用できます。

source: When configuring multiple key pairs or certificate pairs, the server executes the configured pairs in a lexicographical order of their names by default, as demonstrated with `store.pem.a` and `store.pem.b` in the previous example. The pair with the lowest lexicographical order is executed first. To change this, you can define the order by using the `quarkus.tls.key-store.pem.order` property. For example, `quarkus.tls.key-store.pem.order=b,c,a`.
ja_jp: 複数の鍵ペアまたは証明書ペアを設定する場合、前の例の `store.pem.a` と `store.pem.b` で示されているように、サーバーはデフォルトで設定されたペアを名前の辞書順に実行します。 辞書順が最も下位のペアが最初に実行されます。 これを変更するには、`quarkus.tls.key-store.pem.order` プロパティーを使用して順序を定義します。 たとえば、`quarkus.tls.key-store.pem.order=b,c,a` です。

source: When configuring the REST client to use `RestResponse` as the return type, you need to disable the xref:rest-client.adoc#disabling-the-default-mapper[Quarkus REST client default exception mapper], so that no `WebApplicationException` will be thrown when the response status code is not in the successful range (2xx).
ja_jp: REST クライアントを `RestResponse` を戻り値の型として使用するように設定する場合、レスポンスのステータスコードが成功範囲 (2xx) にない場合に `WebApplicationException` がスローされないように、xref:rest-client.adoc#disabling-the-default-mapper[Quarkus REST クライアントのデフォルト例外マッパー] を無効にする必要があります。

source: When configuring the keystore with PEM files, multiple certificate (CRT) and key files must be provided. CRT is a common file extension for X.509 certificate files, typically in PEM (Privacy-Enhanced Mail) format. These files contain the public certificate.
ja_jp: PEM ファイルを使用してキーストアを設定する場合は、複数の証明書 (CRT) ファイルと鍵ファイルを提供する必要があります。 CRT は、X.509 証明書ファイルの一般的なファイル拡張子であり、通常は PEM (Privacy-Enhanced Mail) フォーマットです。 このファイルには公開証明書が含まれています。

source: When configuring the keystore with a JKS or P12 file, the server selects the appropriate certificate based on the SNI host name provided by the client during the TLS handshake. The server matches the SNI hostname with the common name (CN) or subject alternative names (SAN) configured in the certificates stored in the keystore. All keystore and alias passwords must be identical.
ja_jp: JKS または P12 ファイルを使用してキーストアを設定する場合、サーバーが TLS ハンドシェイク中にクライアントによって提供された SNI ホスト名に基づいて適切な証明書を選択します。 サーバーは、SNI ホスト名を、キーストアに保存されている証明書に設定されているコモンネーム (CN) またはサブジェクト代替名 (SAN) と照合します。 すべてのキーストアとエイリアスのパスワードが同一である必要があります。

source: When configuring the keystore with a JKS or P12 file, the server selects the appropriate certificate based on the SNI hostname provided by the client during the TLS handshake. The server matches the SNI hostname with the common name (CN) or subject alternative names (SAN) configured in the certificates stored in the keystore. All keystore and alias passwords must be identical.
ja_jp: JKS または P12 ファイルを使用してキーストアを設定する場合、サーバーは TLS ハンドシェイク中にクライアントから提供された SNI ホスト名に基づいて適切な証明書を選択します。サーバーは、SNI ホスト名を、キーストアに保存されている証明書に構成されたコモンネーム (CN) またはサブジェクト代替名 (SAN) と照合します。すべてのキーストアおよびエイリアスのパスワードは同一である必要があります。

source: When connecting to link:https://astra.datastax.com[DataStax Astra], instead of providing a contact point and a datacenter, you should provide a so-called _secure connect bundle_, which should point to a valid path to an Astra secure connect bundle file. You can download your secure connect bundle from the Astra web console.
ja_jp: link:https://astra.datastax.com[DataStax Astra] に接続する場合には、接続先とデータセンターを提供する代わりに、いわゆる _セキュア接続バンドル_ を提供して、Astra のセキュア接続バンドルファイルへの有効なパスを指定する必要があります。セキュア接続バンドルは、AstraWeb コンソールからダウンロードできます。

source: When consuming messages with `@Channel`, the application code is responsible for subscribing to the stream. In the example above, the Quarkus REST (formerly RESTEasy Reactive) endpoint handles that for you.
ja_jp: `@Channel` でメッセージを消費する場合、アプリケーションコードがストリームへのサブスクライブを行います。 上記の例では、Quarkus REST (旧称 RESTEasy Reactive) エンドポイントがサブスクリプションを処理します。

source: When consuming messages with `@Channel`, the application code is responsible for the subscription. In the example above, RESTEasy endpoint handles that for you.
ja_jp: `@Channel` でメッセージを消費する場合、アプリケーション・コードがサブスクリプションの責任を負います。 上記の例では、RESTEasy エンドポイントがその処理を行います。

source: When consuming messages with `@Channel`, the application code is responsible for the subscription. In the example above, the Quarkus REST (formerly RESTEasy Reactive) endpoint handles that for you.
ja_jp: `@Channel` でメッセージを消費する場合、アプリケーションコードがサブスクリプションを行います。 上記の例では、Quarkus REST (旧称 RESTEasy Reactive) エンドポイントがサブスクリプションを処理します。

source: When consuming messages with `@Channel`, the application code is responsible for the subscription. In the example above, the RESTEasy Reactive endpoint handles that for you.
ja_jp: `@Channel` でメッセージを消費する場合、アプリケーションコードがサブスクリプションを行います。上記の例では、RESTEasy Reactive エンドポイントが処理します。

source: When creating a custom `QuarkusTestResourceLifecycleManager` that needs to inject something into the test class, the `inject` methods can be used. If for example you have a test like the following:
ja_jp: テストクラスに何かを注入する必要があるカスタムの `QuarkusTestResourceLifecycleManager` を作成する場合、 `inject` メソッドを使用できます。 たとえば、次のようなテストがある場合などです。

source: When creating a custom `QuarkusTestResourceLifecycleManager` that needs to inject the something into the test class, the `inject` methods can be used. If for example you have a test like the following:
ja_jp: テストクラスに何かを注入する必要があるカスタム の `QuarkusTestResourceLifecycleManager` を作成する場合、 `inject` メソッドを使用できます。たとえば、次のようなテストがある場合:

source: When creating a custom credentials provider in a new extension, there are a few additional considerations.
ja_jp: 新しいエクステンションでカスタムクレデンシャルプロバイダーを作成する際には、いくつかの追加考慮事項があります。

source: When creating manual instrumentation, while naming metrics or attributes you should follow those conventions and not create new names to represent existing conventions. This will make data correlation easier to perform across services.
ja_jp: 手動計装を作成する場合、これらの規則に従ってメトリクスまたは属性の名前を決定し、既存の規則を表す新しい名前は使用しないでください。これにより、サービス間でデータの相関関係を簡単に実行できるようになります。

source: When creating tags using this interface, it's important to limit the cardinality of the values, otherwise there is a risk of severely degrading the metrics system's capacity.
ja_jp: このインターフェイスを使用してタグを作成する場合、値のカーディナリティーを制限することが重要です。制限しない場合、メトリクスシステムの容量が大幅に低下するリスクがあります。

source: When cross-referencing content, always use the inter-document `xref:` syntax and supply a human-readable label to your link.
ja_jp: コンテンツを相互参照する場合は、常にドキュメント間の `xref:` 構文を使用し、人間が判読できるラベルをリンクに付けてください。

source: When declaring interceptor bindings of an interceptor, you can add multiple `@Repeatable` annotations to the interceptor class as usual. This is useless when the annotation members are `@Nonbinding`, as would be the case for the `@Cached` annotation, but is important otherwise.
ja_jp: インターセプタ―のインターセプタ―バインディングを宣言する場合は、通常どおり、インターセプタ―クラスに複数の `@Repeatable` アノテーションを追加できます。 `@Cached` アノテーションの場合と同様に、アノテーションメンバーが `@Nonbinding` の場合は役に立ちませんが、それ以外の場合は重要になります。

source: When defining TLS configurations in a single centralized location, you can use the TLS Registry to reference them from multiple components within the application, ensuring consistency and reducing the risk of configuration errors.
ja_jp: TLS 設定を 1 カ所で集中して定義する場合、TLS レジストリーを使用してアプリケーション内の複数のコンポーネントからそれらを参照できるため、一貫性が確保され、設定エラーのリスクが軽減されます。

source: When deploying to local Kubernetes environments, users often perform minor changes to their manifests that simplify the development process. The most common changes are:
ja_jp: ローカルのKubernetes環境にデプロイするとき、ユーザーは開発プロセスを簡素化するために、マニフェストにマイナーな変更を行うことがよくあります。 最も一般的な変更は次のとおりです：

source: When deploying your application, you need to deploy the whole `quarkus-app` directory.
ja_jp: アプリケーションをデプロイする際には、 `quarkus-app` ディレクトリ全体をデプロイする必要があります。

source: When deployment is enabled, the Kubernetes extension will select the resources specified by `quarkus.kubernetes.deployment-target` and deploy them. This assumes that a `.kube/config` is available in your user directory that points to the target Kubernetes cluster. In other words the extension will use whatever cluster `kubectl` uses. The same applies to credentials.
ja_jp: デプロイメントを有効にすると、Kubernetes エクステンションは `quarkus.kubernetes.deployment-target` で指定されたリソースを選択してデプロイします。これは、ターゲットの Kubernetes クラスターを指す `.kube/config` がユーザーディレクトリーで利用可能であることを前提としています。言い換えれば、エクステンションは `kubectl` が使用しているクラスターであればどれでも使用します。これは、クレデンシャルについても当てはまります。

source: When developing a Quarkus extension, you mainly want to test that your feature is properly deployed in an application and works as expected. That's why the tests will be hosted in the `deployment` module.
ja_jp: Quarkus エクステンションを開発する際には、主に機能がアプリケーションに適切にデプロイされ、期待通りに動作するかどうかをテストしたいと思うでしょう。そのため、テストは `deployment` モジュールでホストされます。

source: When developing a Quarkus extension, you mainly want to test your feature is properly deployed in an application and works as expected. That's why the tests will be hosted in the `deployment` module.
ja_jp: Quarkus エクステンションを開発する際には、主に機能がアプリケーションに正しくデプロイされ、期待通りに動作するかどうかをテストすることを考える必要があります。そのため、テストは `deployment` モジュールでホストされます。

source: When developing applications with Quarkus, you can decide how to manage password storage and hashing. You can choose to keep the default password and hashing settings of Quarkus, or you can hash passwords manually.
ja_jp: Quarkusでアプリケーションを開発する場合、パスワードのストレージとハッシュ化の管理方法を決めることができます。Quarkusのデフォルトのパスワードとハッシュの設定を維持するか、パスワードを手動でハッシュ化するかを選択できます。

source: When developing applications with Quarkus, you can decide how to manage password storage and hashing. You can keep the default password and hashing settings of Quarkus, or you can hash passwords manually.
ja_jp: Quarkusでアプリケーションを開発する場合、パスワードの保存とハッシュの管理方法を決定できます。Quarkusのデフォルトのパスワードとハッシュ設定を維持することも、手動でパスワードをハッシュ化することもできます。

source: When developing with TLS, you can use two types of certificates:
ja_jp: TLS を使用して開発する場合、次の 2 種類の証明書を使用できます。

source: When discussing Quarkus transactions, this guide refers to Jakarta Transactions transaction style and uses only the term _transaction_ to address them.
ja_jp: Quarkusのトランザクションについて説明する場合、このガイドではJakarta Transactionsのトランザクションスタイルを参照し、 _トランザクション_ という用語のみを使用して説明します。

source: When docker registries are used, users often provide credentials, so that an image is built and pushed to the specified registry during the build.
ja_jp: Dockerレジストリを使用する場合、ユーザーはしばしばクレデンシャルを提供し、ビルド中にイメージがビルドされ、指定されたレジストリにプッシュされます。

source: When doing so, Quarkus will infer the database version and (if possible) dialect from that datasource. For unsupported databases, you may still need to set the Hibernate ORM dialect explicitly, as explained in <<hibernate-dialect-other-databases,this section>>.
ja_jp: これを実行すると、Quarkus はそのデータソースからデータベースのバージョンと (可能な場合) ダイアレクトを推測します。 サポートされていないデータベースの場合は、<<hibernate-dialect-other-databases,this section>> で説明したように、 Hibernate ORM ダイアレクトを明示的に設定する必要がある場合があります。

source: When done, the output will display the URL of your application (target url), you can use it with curl or directly open it in your browser using `gcloud app browse`.
ja_jp: 完了すると、出力にはアプリケーションの URL (ターゲット URL) が表示されます。curlを使うか、 `gcloud app browse` を使ってブラウザで直接開くことができます。

source: When done, you can configure your Quarkus application by adding the following properties to your `application.properties`:
ja_jp: 完了したら、 `application.properties` に以下のプロパティを追加して、Quarkusアプリケーションを設定することができます:

source: When editing a resource class while the current Quarkus application is running in development mode (`./mvnw compile quarkus:dev` or `./gradlew quarkusDev`), there are now CodeLenses that provide the URL for the REST endpoints.
ja_jp: 現在のQuarkusアプリケーションが開発モード( `./mvnw compile quarkus:dev` または `./gradlew quarkusDev`)で実行されているときにリソースクラスを編集すると、RESTエンドポイントのURLを提供するCodelensが登場しました。
